#include <iostream>
#include <string>
// ➟Декоратор➟Гидра➟Гермес➟Испытание Клио➟Гордиев узел➟Угадай статую➟Семейное древо➟Эней

int main()
{
    std::string a[9] = {"Декоратор", "Гидра", "Гермес", "Испытание Клио", "Гордиев узел", "Угадай статую", "Семейное древо", "Эней", "Узы Орфея"};
    std::string b[9] = {"Гермес", "Артемида", "Посейдон", "Ника", "Афина", "Гефест", "Персефона", "Дионис", "Апполон"};
    std::string s = "➟";
    for (int i = 0; i < 9; i++) {
        std::cout << b[i] << std::endl;
        for (int j = 0; j < 9; j++) {
            std::cout << s << a[(j+i) % 9];
        }
        std::cout << std::endl << std::endl;
    }
}